Tekla.Structures.ModelInternal.GenericDelegateFake`1
Implements ICDelegate so that every method returns according to Tekla.Structures.RemotingHelper.IReturnStrategy
Can be used in unit testing to mock Tekla Structures behavior, by setting
a ICDelegate instance using Tekla.Structures.ModelInternal.CDelegateSetter.

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreatePart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateAssembly(Tekla.Structures.ModelInternal.dotAssembly_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportValidateLoftedPlate(System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateBentPlateByParts(System.Int32,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateBentPlateByPartsAndRadius(System.Int32,System.Int32,System.Double)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateConicalBentPlateByPartsAndRadiusAperture(System.Int32,System.Int32,System.Double,System.Double)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateConicalBentPlateByPartsAndTwoRadiuses(System.Int32,System.Int32,System.Double,System.Double)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateBentPlateByFacesAndRadius(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateConicalBentPlateByFacesAndRadiusAperture(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@,System.Double,System.Double)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportConnectGeometryTrees(Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportConnectGeometryTreesWithRadius(System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
radius:
clientId:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportConnectGeometryTreesWithRadiusAperture(System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
largestRadius:
halfAperture:
clientId:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportConnectGeometryTreesByPoints(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@,System.Int32)
DO NOT USE! For internal usage only!
side1Start:
side1End:
side2Start:
side2End:
clientId:
bendShape:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportConnectGeometryTreesByPointsWithRadius(System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
radius:
side1Start:
side1End:
side2Start:
side2End:
clientId:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportConnectGeometryTreesByPointsWithRadiusAperture(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
largestRadius:
halfAperture:
side1Start:
side1End:
side2Start:
side2End:
clientId:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyGeometryTreeCylindricalNodeRadius(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyConicalNodeRadiuses(System.Int32,System.Double,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyGeometryTreeConicalNodeByScale(System.Int32,System.Double,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyGeometryTreeCylindricalNodeCurveType(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSetNewBentPlateRoot(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyBendAngle(System.Double,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyGeometryTreePolygonNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExplodeBentPlate(System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportExtractBentPlateFromComponent(System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyBendSurfaceNode(System.Int32,System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
geometryNodeId:
firstBoundaryPoints:
secondBoundaryPoints:
surfacePoints:
clientId:
Returns:

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetBentPlateMinimumRadius(System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetBentPlateMaximumRadiuses(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetSpiralBeamEndPoint(System.Double,System.Double,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotVector_t@,Tekla.Structures.Internal.dotPoint_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCalculateContourPolygon(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only.
contour: The contour.
polygon: The polygon.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSelectPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSelectPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSelectLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetBoltedPartsHoleElevations(System.Int32,System.Collections.Generic.Dictionary{System.Int32,System.Tuple{System.Double,System.Double}})
DO NOT USE! For internal usage only!
boltId: The bolt identifier.
holeElevations: The hole elevations.
Returns: 1 if successful; otherwise 0.

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyPart(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyPartWithGeometryTree(Tekla.Structures.ModelInternal.dotPart_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyLoftedPlate(Tekla.Structures.ModelInternal.dotPart_t@,System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t}}@,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyFabricatorProject(Tekla.Structures.ModelInternal.dotFabricatorProject_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetAttributeFiles(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetAttributeFilesWithPrefix(Tekla.Structures.ModelInternal.dotGetAttributeFiles_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: Number of files found.

Tekla.Structures.ModelInternal.GenericDelegateFake`1.EditMacro(System.String)
The EditMacro
FileName:  The macro filename
Returns:  Returns an integer

Tekla.Structures.ModelInternal.GenericDelegateFake`1.StartMacroRecording(System.String)
The StartMacroRecording
FileName: The macro filename
Returns: Returns an integer

Tekla.Structures.ModelInternal.GenericDelegateFake`1.StopMacroRecording
The StopMacroRecording
Returns:  Returns an integer

Tekla.Structures.ModelInternal.GenericDelegateFake`1.RefreshMacroList
The RefreshMacroList
Returns:  Returns an integer

Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsMacroRecording
The IsMacroRecording
Returns:  Returns an integer

Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSingleRebarGetRebarSet(System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSelectLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportModifyLegSurfaceObject(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateLegSurfaceByFace(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,System.Int32,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportCreateViewSnapshotToFile(System.String,System.Int32,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.StartLiveSharing(Tekla.Structures.Model.Internal.IChangeSetCreatedCallback,System.Guid,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.StopLiveSharing(System.Guid)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.CreateBaseline(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32,Tekla.Structures.Model.Internal.ICancellableProgressReportCallback)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetPendingChangeSets(System.String,Tekla.Structures.Model.Internal.LiveSharingModelType,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.AddChangeSet(System.String,System.String,System.Byte[])


Tekla.Structures.ModelInternal.GenericDelegateFake`1.RemoveChangeSet(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetEventTimeGuid(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.EventsDbTimeOrdered(System.String,System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.WriteEventToDatabase(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.RenameEvent(System.String,System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.HighlightSelectedBoltParts(System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.HighlightConnectedObjects(System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.UnhighlightConnectedObjects


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetTSLanguageCultureString


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetNumberingTemporaryRecordList


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetNumberingSettings(Tekla.Structures.ModelInternal.dotNumberingSettingsType_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.RegisterAssertCallback(Tekla.Structures.Model.Internal.IAssertEventCallback)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.RunNumberingCommandWithPreview(System.Boolean,System.Boolean)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.AcceptNumberingResults


Tekla.Structures.ModelInternal.GenericDelegateFake`1.RejectNumberingResults


Tekla.Structures.ModelInternal.GenericDelegateFake`1.CheckABMNumbering(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotCheckABMResult_t}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetDeletedSubmittedPartsCount(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ProcessABMNumbering(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.GenericDelegateFake`1.UnnumberProcurementParts(System.Collections.Generic.List{System.Int32})


Tekla.Structures.ModelInternal.GenericDelegateFake`1.SendCustomPartsToABMNumbering(System.Collections.Generic.List{System.Int32},System.String,System.String@,System.String@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.SetAbmSettings(Tekla.Structures.ModelInternal.dotAbmSettings_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ClearOldFabricatorSettings


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetNormalizedPlateProfileName(System.Int32,System.Int32)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsValidFabricatorProfile(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsValidFabricatorMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsValidFabricatorFinish(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsProfileAccepted(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsMaterialAccepted(System.String,System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.IsFinishAccepted(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.AddAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.AddAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.AddAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.DeleteAcceptedProfile(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.DeleteAcceptedMaterial(System.String,System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.DeleteAcceptedFinish(System.String)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ClearVirtualBarCache


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportSetTemporaryVisibility(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportResetTemporaryVisibility(Tekla.Structures.ModelInternal.dotSetTemporaryStates_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetReportProperty(System.String,System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ExportGetHiddenObjects(Tekla.Structures.ModelInternal.dotIntegerIdList_t@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetOverlayModelEntityIdsFromIfcGuids(System.String,System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.Int32}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.GetOverlayModelEntitiesIfcGuidsFromIds(System.String,System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{System.String}@)


Tekla.Structures.ModelInternal.GenericDelegateFake`1.ShowAssembliesHierarchy(System.Collections.Generic.List{System.Int32})
